---
kind: method
id: M:Autodesk.Revit.DB.CategorySet.Erase(Autodesk.Revit.DB.Category)
source: html/30ebd171-b8ff-e4f9-8a80-22d62fc8a654.htm
---
# Autodesk.Revit.DB.CategorySet.Erase Method

Removes a specified category from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	Category item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Category`) - The category to be erased.

## Returns
The number of items that were erased from the set.